number = int(input('Введите первое число геометрической прогресси (диапазон от -10000 до 10000): ')) #Ввод первого числа геом. прогресии
shag = int(input('Введите шаг геометрической прогрессии (диапазон от 1 до 50): ')) #Ввод шага геом. прогресии
last_number = int(input('Введите порядковый номер последнего элемента (диапазон от 2 до 100): ')) #Ввод порядкового номера последнего элемента (значение этой переменной также будет равно количеству членов, для которых посчитается сумма прогресии)
if -10000<=number<=10000 and  1<=shag<=50 and 2<=last_number<=100: #Проверка введённых данных на принадлежность диапазону
    Sn =int(number*(1-(shag)**last_number)/(1-shag)) #Сумма геометрической прогрессии для n членов (как было написано выше,n=last_number)
    print(f'Сумма {last_number} первых членов геометрической прогресии: {Sn}') #Вывод суммы геом прогресии
else: 
    print('Введёные данные не входят в диапазон, перепроверьте ввод')  #Если данные не входят в диапазон, то выводится данное сообщение