b = int(input('Введите первое число геометрической прогресси (диапазон от -10000 до 10000): ')) #Ввод первого числа геом. прогресии
q = int(input('Введите шаг геометрической прогрессии (диапазон от 1 до 50): ')) #Ввод шага геом. прогресии
n = int(input('Введите порядковый номер последнего элемента (диапазон от 2 до 100): ')) #Ввод порядкового номера последнего элемента (значение этой переменной также будет равно количеству членов, для которых посчитается сумма прогресии)
if -10000<=b<=10000 and  1<q<=50 and 2<=n<=100: #Проверка введённых данных на принадлежность диапазону
    Sn =int(b*(1-(q)**n)/(1-q)) #Сумма геометрической прогрессии для n членов (как было написано выше,n=last_number)
    print(f'Сумма {n} первых членов геометрической прогресии: {Sn}') #Вывод суммы геом прогресии
elif q == 1: 
    print(f'Сумма первых {n} членов геометрической прогресии: {n*b}') #Если шаг прогрессии равен 1, то выведется сумма, которая равна произведению первого элемента на кол-во элементов
elif n == 1:
    print(f'Сумма одного члена прогресии, это есть первый член прогрессии: {b}') #Выводится тогда, когда пользователь хочет посчитать сумму для 1 члена прогресии (это и будет 1 член прогресии)
else: 
    print('Введёные данные не входят в диапазон, перепроверьте ввод')  #Если данные не входят в диапазон, то выводится данное сообщение