b = int(input('Введите первое число геометрической прогрессии (диапазон от -10000 до 10000): ')) #Ввод первого числа геом. прогресcии
q = int(input('Введите множитель геометрической прогрессии (диапазон от 1 до 50): ')) #Ввод множителя геом. прогресcии
n = int(input('Введите порядковый номер последнего элемента (диапазон от 2 до 100): ')) #Ввод порядкового номера последнего элемента (значение этой переменной также будет равно количеству членов, для которых посчитается сумма прогресcии)
if -10000<=b<=10000 and  1<=q<=50 and 2<=n<=100: #Проверка введённых данных на принадлежность диапазону
    if q == 1: 
        print(f'Сумма первых {n} членов геометрической прогрессии: {n*b}') #Если множитель прогрессии равен 1, то выведется сумма, которая равна произведению первого элемента на кол-во элементов
    else:
        Sn =int(b*(1-(q)**n)/(1-q)) #Сумма геометрической прогрессии для n членов
        print(f'Сумма первых {n} членов геометрической прогрессии: {Sn}') #Вывод суммы геом прогресcии
else: 
    print('Введённые данные не входят в диапазон, перепроверьте ввод')  #Если данные не входят в диапазон, то выводится данное сообщение