n = int(input('Введите число: ')) #Ввод числа
n1 = n #Сохраним первоначальное значение n, чтобы после конца цикла вывести его в ответе
i = 0 #Счётчик операций
if 1<=n<=100000: #Проверка на принадлежность диапазону
    while n !=0: #Цикл будет идти до тех пор, пока заданное число не станет равно 0
        if n % 3 ==0: #Если число делится на 3 без остатка, то просто отнимем от него 3
            n -=3   
        elif n % 3 ==1: #Если остаток от деления на 3 равен 1, то отнимем 1
            n -=1
        else: #Если остаток от деления на 3 равен 2, то отнимем 2
            n -=2
        i +=1 #В конце цикла к счётчику операций добавим 1 операцию
    print(f'Требуемое количество операций, для того, чтобы достичь 0 начиная с {n1}: {i}') #Вывод результата
else:
    print('Число не входит в диапазон') #Если число не входит в диапазон