print('Данная программа проверяет, простое число или нет, если число простое, то вывод - Y, если составное, то - N')
n = int(input('Введите число (в диапазоне от 1 до 25): ')) #Ввод числа
pr=True #Изначально предположим что число простое
if 1<=n<=25: 
    if n == 1:
        print('Число 1 не является ни составным ни простым') #Если число равно 1, то выводится данное сообщение
    else:
        for i in range (2, int(n**0.5)+1):  #i - делитель, промежуток будет от 2 до корня из введённого числа, т.к дальше проверка бессмысленна
            if n % i ==0:
                pr=False
                break  #Если находится число (делитель), который делит заданное число без остатка, то флаг простого числа сразу выставляется на False, цикл прерывается
        if pr==True:
            print(f'Число {n} - Y')
        elif pr==False:
            print(f'Число {n} - N')
else:
    print(f'Введёное число не входит в диапазон')    #Если число не входит в диапазон, то выводится данное сообщение