print('Данная программа проверяет, простое число или нет, если число простое, то вывод - Y, если составное, то - N')
n = int(input('Введите число (в диапазоне от 1 до 25): ')) #Ввод числа
pr=True #Изначально предположим что число простое
if 1<=n<=25: #Проверка диапазона
    if n == 1: #Частный случай при котором пользователь задал 1
        print('Число 1 не является ни составным ни простым') #Если число равно 1, то выводится данное сообщение
    else: #Остальной промежуток (от 2 до 25)
        for i in range (2, int(n**0.5)+1): #i - делитель, промежуток будет от 2 до корня из введённого числа, т.к дальше проверка бессмысленна
            if n % i ==0: 
                pr=False #Если у заданного числа находится делитель, то флаг меняется на False, следовательно число составное
                break #Если находится число (делитель), который делит заданное число без остатка, то флаг простого числа сразу выставляется на False, цикл прерывается
        if pr==True: #Если флаг числа после всех проверок остался True, то число простое
            print(f'Число {n} - Y') #Вывод в случае, если число простое
        elif pr==False: #Флаг False стоит у числа в том случае, когда мы нашли делитель, следовательно число не простое
            print(f'Число {n} - N') #Вывод в случае если число не простое
else:
    print('Введённое число не входит в диапазон') #Если число не входит в диапазон, то выводится данное сообщение